[
  { "sender": "Misko Hevery", "date": "1384107929000", "subject": "Didja get that thing I sencha?", "body": "A great way to get introduced to AngularJS is to work through this tutorial, which walks you through the construction of an AngularJS web app. The app you will build is a catalog that displays a list of Android devices, lets you filter the list to see only devices that interest you, and then view details for any device." },
  { "sender": "Igor Minar", "date": "1383102818000", "subject": "Angular time-dilation features causing problems with causation", "body": "AngularJS is a structural framework for dynamic web apps. It lets you use HTML as your template language and lets you extend HTMLs syntax to express your applications components clearly and succinctly. Out of the box, it eliminates much of the code you currently write through data binding and dependency injection. And it all happens in JavaScript within the browser, making it an ideal partner with any server technology. Angular is what HTML would have been had it been designed for applications. HTML is a great declarative language for static documents. It does not contain much in the way of creating applications, and as a result building web applications is an exercise in what do I have to do to trick the browser into doing what I want." },
  { "sender": "Brian Ford", "date": "1382107917000", "subject": "Our super fun schedule at Devoxx", "body": "Angular simplifies application development by presenting a higher level of abstraction to the developer. Like any abstraction, it comes at a cost of flexibility. In other words not every app is a good fit for Angular. Angular was built for the CRUD application in mind. Luckily CRUD applications represent the majority of web applications. But to understand what Angular is good at one also has to understand when an app is not a good fit for Angular. Games and GUI editors are examples of applications with intensive and tricky DOM manipulation. These kinds of apps are different from CRUD apps, and as a result are probably not a good fit for Angular. In these cases it may be better to use a library with a lower level of abstraction, such as jQuery." },
  { "sender": "Vojta Jina", "date": "1381107906000", "subject": "Planning for Angular 5.0", "body": "Notice that we achieved this application behavior not by calling Angular methods, nor by implementing application specific behavior as a framework. We achieved the behavior because the browser behaved more in line with what is needed for a dynamic web application rather than what is needed for a static document. Angular has lowered the impedance mismatch to the point where no library/framework calls are needed." },
  { "sender": "Larry Page", "date": "1380107905000", "subject": "Dinner tonight?", "body": "Hey, do you want to check out that new bistro?" }
]